base/InformationRegisters/бит_УдалитьНастройкиВерсионированияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_УдалитьНастройкиВерсионированияОбъектов</Name>
			<Comment>Настройки версионирования объектов (БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_УдалитьВариантыВерсионированияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/InformationRegisters/бит_УдалитьНастройкиВерсионированияОбъектов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Процедура - обработчик события "НачалоВыбора" поля ввода "ОбъектСистемы".
//
&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов"           , фКэшЗначений.СписокВидовОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы"   , Запись.ОбъектСистемы);
	ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", фКэшЗначений.СписокДоступныхОбъектов);
	
	ОткрытьФормуМодально("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры // ОбъектСистемыНачалоВыбора()

// Процедура - обработчик события "ПриИзменении" поля ввода "ОбъектСистемы".
//
&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
	ПроверитьВозможностьПроведенияОбъекта(Запись.ОбъектСистемы);
	
КонецПроцедуры // ОбъектСистемыПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля ввода "Вариант".
//
&НаКлиенте
Процедура ВариантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПеречВариантыВерсионирования = фКэшЗначений.Перечисления.бит_ВариантыВерсионированияОбъектов;
	
	// Список выбора
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(ПеречВариантыВерсионирования.ВерсионироватьПриЗаписи);	
	ДанныеВыбора.Добавить(ПеречВариантыВерсионирования.НеВерсионировать);
	
	// Для документов
	Если ЕстьПроведение Тогда		
		ДанныеВыбора.Добавить(ПеречВариантыВерсионирования.ВерсионироватьПриПроведении);		
	КонецЕсли;	
	
КонецПроцедуры // ВариантНачалоВыбора()


////////////////////////////////////////////////////////////////////////////////
// СЕРВЕРНЫЕ ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	ЗаполнитьКэшЗначений();
	
	ПроверитьВозможностьПроведенияОбъекта(Запись.ОбъектСистемы);
	
КонецПроцедуры // ПриСозданииНаСервере()


////////////////////////////////////////////////////////////////////////////////
// СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	фКэшЗначений = Новый Структура;
	
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.Справочник);
	СписокВидовОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.Документ);
	фКэшЗначений.Вставить("СписокВидовОбъектов" , СписокВидовОбъектов);
	
	фКэшЗначений.Вставить("СписокДоступныхОбъектов", СформироватьСписокДоступныхОбъектов());
	
	
	КэшПеречислений = Новый Структура;
	КэшПеречислений.Вставить("бит_ВариантыВерсионированияОбъектов", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_УдалитьВариантыВерсионированияОбъектов));
		
	фКэшЗначений.Вставить("Перечисления",КэшПеречислений);

КонецПроцедуры // ЗаполнитьКэшЗначений()

// Функция формирует список доступных объектов системы.
//
// Возвращаемое значение:
//   СписокЗначений
//
&НаСервере
Функция СформироватьСписокДоступныхОбъектов()

	СписокОбъектовСистемы = Новый СписокЗначений;
	
	ДоступныеТипы = Метаданные.ОбщиеКоманды.бит_УдалитьИсторияВерсионирования.ТипПараметраКоманды.Типы();
	
	Для каждого ТипОбъекта Из ДоступныеТипы Цикл
	
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипОбъекта);
		ТекОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаданныеОбъекта);
		СписокОбъектовСистемы.Добавить(ТекОбъектСистемы);
			
	КонецЦикла;
		
	Возврат СписокОбъектовСистемы;
	
КонецФункции // СформироватьСписокДоступныхОбъектов()

// Функция проверяет есть ли возможность проведения объекта системы
//
// Параметры:
//  Нет
//  
// Возвращаемое значение:
//   Булево
//
&НаСервере
Процедура ПроверитьВозможностьПроведенияОбъекта(ОбъектСистемы)

	Если ЗначениеЗаполнено(ОбъектСистемы)
		И ОбъектСистемы.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Документ Тогда
		
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ОбъектСистемы.ТипЗначенияОбъекта.Получить()); 		
		ЕстьПроведение = МетаданныеОбъекта.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;		
		
	Иначе
		
		ЕстьПроведение = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьВозможностьПроведенияОбъекта()
